alpha_blog4/app/views/articles/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ?  [["article_id", 17]]
SELECT 1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ? LIMIT ?  [["article_id", 17], ["LIMIT", 1]]
---
            <%= link_to gravitar_for(@article.user), user_path(@article.user) %>
            <% if @article.categories.any? %>