alpha_blog4/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "tip5 tip5"], ["description", "artikl od tipa5"], ["created_at", "2022-03-28 11:14:54.143644"], ["updated_at", "2022-03-28 11:14:54.143644"], ["user_id", 9]]
---
  def create

    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save