alpha_blog4/app/controllers/users_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
---
  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 5)

SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page: 5)

UPDATE "users" SET "username" = ?, "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["username", "abc"], ["updated_at", "2022-03-21 07:48:09.681955"], ["password_digest", "[FILTERED]"], ["id", 2]]
---
  def update

    if @user = User.update(user_params)

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "name", "password_digest", "admin") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save